In [28]:
df['Name']

0        sam
1        Raj
2      Nidhi
3      Ankit
4        Sam
5    pallavi
6     Garvit
7        sam
Name: Name, dtype: object

In [30]:
df

   Emp_Id     Name  department  Working_hours
0       1      sam          It              8
1       2    Rajat       Sales              9
2       3    Nidhi          It              9
3       4   yamini       Sales              9
4       5      Sam          It              8
5       6  pallavi  operations              9
6       7   Garvit       sales              8
7       8      sam          It              9

In [32]:
df

   Emp_Id     Name  department  Working_hours
0       1      sam          It              8
1       2    Rajat       Sales             10
2       3    Nidhi          It              9
3       4   yamini       Sales              9
4       5      Sam          It              8
5       6  pallavi  operations              9
6       7   Garvit       sales              8
7       8      sam          It              9

In [33]:
df['Name'].value_counts()

Name
sam        2
Rajat      1
Nidhi      1
yamini     1
Sam        1
pallavi    1
Garvit     1
Name: count, dtype: int64

In [35]:
df['department'].value_counts()

department
It            4
Sales         2
operations    1
sales         1
Name: count, dtype: int64

In [37]:
df.isnull().sum()

Emp_Id           0
Name             0
department       0
Working_hours    0
dtype: int64

In [38]:
df

   Emp_Id     Name  department  Working_hours
0       1      sam          It              8
1       2    Rajat       Sales             10
2       3    Nidhi          It              9
3       4   yamini       Sales              9
4       5      Sam          It              8
5       6  pallavi  operations              9
6       7   Garvit       sales              8
7       8      sam          It              9

In [44]:
df.isnull().sum()

Emp_Id           0
Name             1
department       2
Working_hours    0
dtype: int64

In [45]:
df = df.dropna()

In [46]:
df

   Emp_Id    Name department  Working_hours
0       1     sam         It              8
1       2   Rajat      Sales             10
3       4  yamini      Sales              9
6       7  Garvit      sales              8
7       8     sam         It              9